slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Formation Javascript</title>
<meta name="author" content="(Emmanuel Auclair)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Formation Javascript</h1><h2 class="author">Emmanuel Auclair</h2><p class="date">Created: 2018-04-13 Fri 16:24</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgee63908">1. Presentation &amp; History</a></li>
<li><a href="#/slide-orgeac0c50">2. Syntax</a></li>
<li><a href="#/slide-org32c89f9">3. Types &amp; Primitives</a></li>
<li><a href="#/slide-org5499cca">4. Basic Operations</a></li>
<li><a href="#/slide-orgb8abf46">5. Numbers</a></li>
<li><a href="#/slide-org6371f3b">6. Strings</a></li>
<li><a href="#/slide-org25eca19">7. Variables</a></li>
<li><a href="#/slide-org66e6d0a">8. Functions</a></li>
<li><a href="#/slide-orge454c5a">9. Arrays</a></li>
<li><a href="#/slide-orgac39f73">10. Objects</a></li>
<li><a href="#/slide-org234b0b1">11. Asynchronocity</a></li>
<li><a href="#/slide-orgfc07891">12. Tools</a></li>
<li><a href="#/slide-orgef3d57f">13. Misc</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgee63908">
<h2 id="orgee63908"><span class="section-number-2">1</span> Presentation &amp; History</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
</section>
<section>
<section id="slide-orgfe0db41">
<h3 id="orgfe0db41"><span class="section-number-3">1.1</span> History overview</h3>
<p>
Some contents.
</p>

<aside class="notes">
<p>
My notes
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org3086b6b">
<h3 id="org3086b6b"><span class="section-number-3">1.2</span> Evolution: ES6/7/&#x2026;</h3>
<p>
TODO: Talk about Typescript ? compare with ES6/7, intellisense support&#x2026;
Beware of functionnalities not yet official but used everywhere
</p>

<div class="org-src-container">

<pre  class="src src-js"><span style="color: #7fffd4;">undefined</span>
<span style="color: #7fffd4;">null</span>
<span style="color: #00ffff;">function</span> <span style="color: #87cefa;">toto</span><span style="color: #00ff00; font-weight: bold;">()</span> <span style="color: #00ff00; font-weight: bold;">{</span>
  <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">titit</span> = <span style="color: #7fffd4;">null</span>;
<span style="color: #00ff00; font-weight: bold;">}</span>
</pre>
</div>
<pre class="example">
undefined

</pre>

</section>
</section>
<section>
<section id="slide-org9468569">
<h3 id="org9468569"><span class="section-number-3">1.3</span> JS The Good Parts</h3>

</section>
</section>
<section>
<section id="slide-orgeac0c50">
<h2 id="orgeac0c50"><span class="section-number-2">2</span> Syntax</h2>
<p>
TODO: semi-colon, line feed, instruction/expression/statement stuff
</p>
</section>
</section>
<section>
<section id="slide-orgc135377">
<h3 id="orgc135377"><span class="section-number-3">2.1</span> Reserved keywords</h3>
<p>
TODO: if for switch case default class&#x2026;
</p>
</section>
</section>
<section>
<section id="slide-org32c89f9">
<h2 id="org32c89f9"><span class="section-number-2">3</span> Types &amp; Primitives</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
</section>
<section>
<section id="slide-orgfa4647a">
<h3 id="orgfa4647a"><span class="section-number-3">3.1</span> Primitive Types</h3>
<div class="outline-text-3" id="text-3-1">
</div>
</section>
<section id="slide-orgcde11e5">
<h4 id="orgcde11e5"><span class="section-number-4">3.1.1</span> undefined</h4>
</section>
<section id="slide-org30ad3d2">
<h4 id="org30ad3d2"><span class="section-number-4">3.1.2</span> null</h4>
</section>
<section id="slide-org97142be">
<h4 id="org97142be"><span class="section-number-4">3.1.3</span> NaN</h4>
</section>
<section id="slide-orge084f66">
<h4 id="orge084f66"><span class="section-number-4">3.1.4</span> Boolean</h4>
</section>
<section id="slide-org12c4966">
<h4 id="org12c4966"><span class="section-number-4">3.1.5</span> Number</h4>
</section>
<section id="slide-org9eae72f">
<h4 id="org9eae72f"><span class="section-number-4">3.1.6</span> String</h4>
</section>
<section id="slide-org8710d60">
<h4 id="org8710d60"><span class="section-number-4">3.1.7</span> Array</h4>
<p>
TODO: mutable
</p>
</section>
<section id="slide-org3f8268c">
<h4 id="org3f8268c"><span class="section-number-4">3.1.8</span> Object</h4>
<p>
TODO: hashes/dictionnaries, mutable
</p>
</section>
<section id="slide-org4671866">
<h4 id="org4671866"><span class="section-number-4">3.1.9</span> Functions</h4>
<p>
TODO: first class, have properties like object (eg prototype, length)
</p>
</section>
</section>
<section>
<section id="slide-org1541fcf">
<h3 id="org1541fcf"><span class="section-number-3">3.2</span> Data model</h3>
<div class="outline-text-3" id="text-3-2">
</div>
</section>
<section id="slide-orgef0baff">
<h4 id="orgef0baff"><span class="section-number-4">3.2.1</span> Immutable memory</h4>
<p>
TODO: primitives types are immutable &amp; only one instance of each value in memory
when we modify a value we create a new value elsewhere in memory
Arrays/Object/Functions are the exceptions
</p>
</section>
<section id="slide-orgd7bde1e">
<h4 id="orgd7bde1e"><span class="section-number-4">3.2.2</span> References</h4>
<p>
TODO: every time we name a value in JS, we bind the name to a reference/pointer to the value in memory
we cannot change value, only references to memory
</p>
</section>
</section>
<section>
<section id="slide-org5499cca">
<h2 id="org5499cca"><span class="section-number-2">4</span> Basic Operations</h2>
<div class="outline-text-2" id="text-4">
</div>
</section>
</section>
<section>
<section id="slide-org728986c">
<h3 id="org728986c"><span class="section-number-3">4.1</span> Arithmetics</h3>
<p>
TODO: short overview of arithmetics
</p>
</section>
</section>
<section>
<section id="slide-orge5891ba">
<h3 id="orge5891ba"><span class="section-number-3">4.2</span> Equality</h3>
<p>
TODO: always use compare-by-refs <code>=</code>, never use cast-compare ==
short overview of comparators
</p>
</section>
</section>
<section>
<section id="slide-orga9624ee">
<h3 id="orga9624ee"><span class="section-number-3">4.3</span> Control operators</h3>
<div class="outline-text-3" id="text-4-3">
</div>
</section>
<section id="slide-org0404b30">
<h4 id="org0404b30"><span class="section-number-4">4.3.1</span> if</h4>
</section>
<section id="slide-org4844c42">
<h4 id="org4844c42"><span class="section-number-4">4.3.2</span> switch</h4>
</section>
<section id="slide-org5686343">
<h4 id="org5686343"><span class="section-number-4">4.3.3</span> for</h4>
<p>
TODO: how can we speak of properties here without first speaking of objects?
</p>
</section>
</section>
<section>
<section id="slide-orgb8abf46">
<h2 id="orgb8abf46"><span class="section-number-2">5</span> Numbers</h2>
<div class="outline-text-2" id="text-5">
</div>
</section>
</section>
<section>
<section id="slide-orga74a090">
<h3 id="orga74a090"><span class="section-number-3">5.1</span> IEEE</h3>
<p>
TODO: basic floating point calculation stuff
cast to number tricks, don't use, use Number or parse ?
</p>
</section>
</section>
<section>
<section id="slide-orgb2a7440">
<h3 id="orgb2a7440"><span class="section-number-3">5.2</span> NaN</h3>
<p>
TODO: how we can get a NaN, NaN is the only thing not equal to itself
</p>
</section>
</section>
<section>
<section id="slide-org6371f3b">
<h2 id="org6371f3b"><span class="section-number-2">6</span> Strings</h2>
<div class="outline-text-2" id="text-6">
</div>
</section>
</section>
<section>
<section id="slide-org5c8902a">
<h3 id="org5c8902a"><span class="section-number-3">6.1</span> Quotes</h3>
<p>
TODO: diff btw ' and ", escape chars, basic props
</p>
</section>
</section>
<section>
<section id="slide-orgcc512c3">
<h3 id="orgcc512c3"><span class="section-number-3">6.2</span> ES6: templates</h3>
<p>
TODO: building strings with `
</p>
</section>
</section>
<section>
<section id="slide-org8cf1b0f">
<h3 id="org8cf1b0f"><span class="section-number-3">6.3</span> Methods</h3>
<p>
TODO: overview of most useful methods
</p>
</section>
</section>
<section>
<section id="slide-org25eca19">
<h2 id="org25eca19"><span class="section-number-2">7</span> Variables</h2>
<div class="outline-text-2" id="text-7">
</div>
</section>
</section>
<section>
<section id="slide-org8d4a42d">
<h3 id="org8d4a42d"><span class="section-number-3">7.1</span> References</h3>
<p>
TODO: variables bind names to references to values in memory
changing var value &lt;=&gt; changing the value it points to
</p>
</section>
</section>
<section>
<section id="slide-orgf3e7188">
<h3 id="orgf3e7188"><span class="section-number-3">7.2</span> Scope</h3>
<p>
TODO: local/global
global horror show
function scope
</p>
</section>
</section>
<section>
<section id="slide-orgffa1e97">
<h3 id="orgffa1e97"><span class="section-number-3">7.3</span> Hoisting</h3>
<p>
TODO: var hoisting horror show
</p>
</section>
</section>
<section>
<section id="slide-org5f3ef39">
<h3 id="org5f3ef39"><span class="section-number-3">7.4</span> Strict mode</h3>
</section>
</section>
<section>
<section id="slide-org444c195">
<h3 id="org444c195"><span class="section-number-3">7.5</span> ES6: const &amp; let</h3>
<p>
TODO: always use const, when to use let
sane scope
</p>
</section>
</section>
<section>
<section id="slide-org66e6d0a">
<h2 id="org66e6d0a"><span class="section-number-2">8</span> Functions</h2>
<div class="outline-text-2" id="text-8">
</div>
</section>
</section>
<section>
<section id="slide-org98ed357">
<h3 id="org98ed357"><span class="section-number-3">8.1</span> Arguments</h3>
<p>
TODO: passed by reference, arity fn.length, extra/missing args, arguments value
args manipulation tricks, variable args
</p>
</section>
</section>
<section>
<section id="slide-orgc014551">
<h3 id="orgc014551"><span class="section-number-3">8.2</span> Hoisting</h3>
<p>
TODO: function are hoisted and that's great
</p>
</section>
</section>
<section>
<section id="slide-org904394d">
<h3 id="org904394d"><span class="section-number-3">8.3</span> Closure</h3>
<p>
TODO: how it works, memory leak, comparison with thread stack
</p>
</section>
</section>
<section>
<section id="slide-orgae3cfae">
<h3 id="orgae3cfae"><span class="section-number-3">8.4</span> High order functions</h3>
<p>
TODO: callbacks args, closures return, functionnal algorithms
</p>
</section>
</section>
<section>
<section id="slide-orgb326a9d">
<h3 id="orgb326a9d"><span class="section-number-3">8.5</span> this</h3>
<p>
TODO: this keyword overview, default=global=window, object-method call
var me = this horror show on callbacks
</p>
</section>
</section>
<section>
<section id="slide-orgb3788bf">
<h3 id="orgb3788bf"><span class="section-number-3">8.6</span> apply &amp; call</h3>
<p>
TODO: differences &amp; when to use, args manipulation, this manipulation
</p>
</section>
</section>
<section>
<section id="slide-orgd380ce5">
<h3 id="orgd380ce5"><span class="section-number-3">8.7</span> ES6: arrow functions</h3>
<p>
TODO: possible syntaxes, this difference, use everywhere
</p>
</section>
</section>
<section>
<section id="slide-org4374574">
<h3 id="org4374574"><span class="section-number-3">8.8</span> ES6: arguments spread</h3>
<p>
TODO: variable arguments, args manipulation
</p>
</section>
</section>
<section>
<section id="slide-orga31e829">
<h3 id="orga31e829"><span class="section-number-3">8.9</span> ES6: arguments destructuring</h3>
<p>
TODO: how can I speak of this here without first speaking of arrays ?
</p>
</section>
</section>
<section>
<section id="slide-orge454c5a">
<h2 id="orge454c5a"><span class="section-number-2">9</span> Arrays</h2>
<div class="outline-text-2" id="text-9">
</div>
</section>
</section>
<section>
<section id="slide-orga93d837">
<h3 id="orga93d837"><span class="section-number-3">9.1</span> Methods</h3>
<p>
TODO: basic methods (splice, slice, length, push, pop, concat&#x2026;)
for(var in array)
</p>
</section>
<section id="slide-orgf75da08">
<h4 id="orgf75da08"><span class="section-number-4">9.1.1</span> Array Equality</h4>
</section>
</section>
<section>
<section id="slide-org6a56cd4">
<h3 id="org6a56cd4"><span class="section-number-3">9.2</span> High order methods</h3>
<p>
TODO: filter, map, reduce
</p>
</section>
</section>
<section>
<section id="slide-orgcc32c16">
<h3 id="orgcc32c16"><span class="section-number-3">9.3</span> Typed Arrays</h3>
<p>
TODO: UInt8Array etc
</p>
</section>
</section>
<section>
<section id="slide-org3704ac2">
<h3 id="org3704ac2"><span class="section-number-3">9.4</span> ES6: destructuring</h3>
<p>
TODO: introduce destructuring, compare with ES5 code
</p>
</section>
</section>
<section>
<section id="slide-orgafd7393">
<h3 id="orgafd7393"><span class="section-number-3">9.5</span> ES6: spread</h3>
<p>
TODO: introduce array manipulations with spread
talk about immutability ?
</p>
</section>
</section>
<section>
<section id="slide-orgac39f73">
<h2 id="orgac39f73"><span class="section-number-2">10</span> Objects</h2>
<div class="outline-text-2" id="text-10">
</div>
</section>
</section>
<section>
<section id="slide-orga8d8c99">
<h3 id="orga8d8c99"><span class="section-number-3">10.1</span> Properties</h3>
<div class="outline-text-3" id="text-10-1">
</div>
</section>
<section id="slide-orgb7f58f7">
<h4 id="orgb7f58f7"><span class="section-number-4">10.1.1</span> Getting/Setting</h4>
<p>
TODO: ["prop"] .prop, dynamique
impact on performances
</p>
</section>
<section id="slide-org8d6fbaf">
<h4 id="org8d6fbaf"><span class="section-number-4">10.1.2</span> Deleting</h4>
<p>
TODO: delete, = undefined
impact on performances
</p>
</section>
<section id="slide-orgf5b4714">
<h4 id="orgf5b4714"><span class="section-number-4">10.1.3</span> Methods</h4>
<p>
TODO: invoke, consequences on this
</p>
</section>
<section id="slide-org818ba2c">
<h4 id="org818ba2c"><span class="section-number-4">10.1.4</span> Object Equality</h4>
</section>
</section>
<section>
<section id="slide-org447608f">
<h3 id="org447608f"><span class="section-number-3">10.2</span> ES6: properties shortcut</h3>
</section>
</section>
<section>
<section id="slide-org6c1b4a0">
<h3 id="org6c1b4a0"><span class="section-number-3">10.3</span> Prototype</h3>
<p>
TODO: explain prototype chain
hasOwnProperty, for(var in object)
</p>
</section>
</section>
<section>
<section id="slide-org94328b9">
<h3 id="org94328b9"><span class="section-number-3">10.4</span> new &amp; Contructor functions</h3>
<p>
TODO: explain how it works, traditionnal pattern
impact on performances
</p>
</section>
</section>
<section>
<section id="slide-orgbf7944d">
<h3 id="orgbf7944d"><span class="section-number-3">10.5</span> ES6: Object.create</h3>
<p>
TODO: easy prototype pattern
</p>
</section>
</section>
<section>
<section id="slide-org9e0136c">
<h3 id="org9e0136c"><span class="section-number-3">10.6</span> ES6: classes</h3>
<p>
TODO: for OOP fans, not hoisted :(
</p>
</section>
</section>
<section>
<section id="slide-org702aa24">
<h3 id="org702aa24"><span class="section-number-3">10.7</span> ES7: spread</h3>
<p>
TODO: introduce objects merge with spread
talk about immutability ?
</p>
</section>
</section>
<section>
<section id="slide-org234b0b1">
<h2 id="org234b0b1"><span class="section-number-2">11</span> Asynchronocity</h2>
<div class="outline-text-2" id="text-11">
</div>
</section>
</section>
<section>
<section id="slide-org82fbb53">
<h3 id="org82fbb53"><span class="section-number-3">11.1</span> Execution model</h3>
<p>
TODO: single threaded, asynchronous
Tasks, micro-tasks ?
</p>
</section>
</section>
<section>
<section id="slide-org3c6b4c9">
<h3 id="org3c6b4c9"><span class="section-number-3">11.2</span> Exceptions</h3>
<p>
TODO: try/catch
</p>
</section>
</section>
<section>
<section id="slide-org42bccfd">
<h3 id="org42bccfd"><span class="section-number-3">11.3</span> Callbacks</h3>
<p>
TODO: standard Node form, callback hell, pyramid of doom
</p>
</section>
</section>
<section>
<section id="slide-org8d38d3c">
<h3 id="org8d38d3c"><span class="section-number-3">11.4</span> setTimeout/setInterval</h3>
</section>
</section>
<section>
<section id="slide-org5c1ed61">
<h3 id="org5c1ed61"><span class="section-number-3">11.5</span> ES6: Promises</h3>
<p>
TODO: why, how it works
advantages &amp; inconvenients (spread like a virus)
</p>
</section>
</section>
<section>
<section id="slide-orgde14f39">
<h3 id="orgde14f39"><span class="section-number-3">11.6</span> ES7: async/await</h3>
<p>
TODO: how it works, inconvenients (spread like a virus)
</p>
</section>
</section>
<section>
<section id="slide-orgfc07891">
<h2 id="orgfc07891"><span class="section-number-2">12</span> Tools</h2>
<div class="outline-text-2" id="text-12">
</div>
</section>
</section>
<section>
<section id="slide-orge43a334">
<h3 id="orge43a334"><span class="section-number-3">12.1</span> NPM</h3>
</section>
</section>
<section>
<section id="slide-org0efae05">
<h3 id="org0efae05"><span class="section-number-3">12.2</span> Yarn</h3>
</section>
</section>
<section>
<section id="slide-orgf508ff6">
<h3 id="orgf508ff6"><span class="section-number-3">12.3</span> Eslint</h3>
</section>
</section>
<section>
<section id="slide-orgd76883d">
<h3 id="orgd76883d"><span class="section-number-3">12.4</span> Babel</h3>
</section>
</section>
<section>
<section id="slide-orgb0249c9">
<h3 id="orgb0249c9"><span class="section-number-3">12.5</span> Webpack</h3>
</section>
</section>
<section>
<section id="slide-orge690487">
<h3 id="orge690487"><span class="section-number-3">12.6</span> Chrome debugger</h3>
</section>
</section>
<section>
<section id="slide-orgef3d57f">
<h2 id="orgef3d57f"><span class="section-number-2">13</span> Misc</h2>
<div class="outline-text-2" id="text-13">
</div>
</section>
</section>
<section>
<section id="slide-org5e6f625">
<h3 id="org5e6f625"><span class="section-number-3">13.1</span> Node</h3>
</section>
</section>
<section>
<section id="slide-orgc27e4e7">
<h3 id="orgc27e4e7"><span class="section-number-3">13.2</span> ES6/7/Node modules</h3>
</section>
</section>
<section>
<section id="slide-org1db2772">
<h3 id="org1db2772"><span class="section-number-3">13.3</span> Date</h3>
</section>
</section>
<section>
<section id="slide-org563f86e">
<h3 id="org563f86e"><span class="section-number-3">13.4</span> Lodash</h3>
</section>
</section>
<section>
<section id="slide-org8eac06c">
<h3 id="org8eac06c"><span class="section-number-3">13.5</span> Immutability</h3>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: false,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
width: 1200,
height: 800,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
